In [1]:
import pandas as pd

In [22]:
ser = pd.Series([100, 200, 300,400, 500], ['tom', 'bob', 'nancy', 'dan', 'eric'])
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [23]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [36]:
ser.columns

AttributeError: 'Series' object has no attribute 'columns'

In [25]:
ser.loc[['nancy','tom']]

nancy    300
tom      100
dtype: int64

In [26]:
ser[[4,3,1]]

eric    500
dan     400
bob     200
dtype: int64

In [27]:
ser.iloc[2]

300

In [28]:
'bob' in ser

True

In [29]:
ser ** 2

tom       10000
bob       40000
nancy     90000
dan      160000
eric     250000
dtype: int64

In [30]:
ser[['nancy', 'eric']] ** 2

nancy     90000
eric     250000
dtype: int64

In [31]:
d = {'one': pd.Series([100., 200., 300.], ['apple', 'ball', 'clock']),
     'two': pd.Series([111., 222., 333., 4444.],['apple', 'ball','cerill', 'dancy'])}

In [32]:
df = pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [33]:
print(df
     )

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [34]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [35]:
df.columns

Index(['one', 'two'], dtype='object')

In [37]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [38]:
pd.DataFrame(d, index=['dancy', 'ball', 'apple'], columns=['two', 'five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

In [39]:
data = [{'alex': 1, 'joe': 2}, {'ema':5, 'dora': 10, 'alice': 20}]

In [40]:
data

[{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [41]:
pd.DataFrame(data)

   alex  alice  dora  ema  joe
0   1.0    NaN   NaN  NaN  2.0
1   NaN   20.0  10.0  5.0  NaN

In [42]:
pd.DataFrame(data, index=['orange', 'red'])

        alex  alice  dora  ema  joe
orange   1.0    NaN   NaN  NaN  2.0
red      NaN   20.0  10.0  5.0  NaN

In [43]:
pd.DataFrame(data, columns=['joe', 'dora', 'alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

In [44]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [45]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [46]:
df['three'] = df['one'] * df['two']

In [47]:
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [51]:
df['flag'] = df['one'] > 250

In [52]:
df

          one     two    three   flad   flag
apple   100.0   111.0  11100.0  False  False
ball    200.0   222.0  44400.0  False  False
cerill    NaN   333.0      NaN  False  False
clock   300.0     NaN      NaN   True   True
dancy     NaN  4444.0      NaN  False  False

In [53]:
three = df.pop('three')

In [54]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [55]:
df

          one     two   flad   flag
apple   100.0   111.0  False  False
ball    200.0   222.0  False  False
cerill    NaN   333.0  False  False
clock   300.0     NaN   True   True
dancy     NaN  4444.0  False  False

In [56]:
del df['flad']

In [57]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [58]:
df.insert(2, 'copy_of_one', df['one'])

In [59]:
df

          one     two  copy_of_one   flag
apple   100.0   111.0        100.0  False
ball    200.0   222.0        200.0  False
cerill    NaN   333.0          NaN  False
clock   300.0     NaN        300.0   True
dancy     NaN  4444.0          NaN  False